nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
SemaphoreHandle_t xI2CSemaphore;

#define DEFAULT_SEMAPHORE_TIMEOUT 10

void DAC_TimerEnable(bool sts)
{
  if (timer_dac == NULL)
    return;
  portENTER_CRITICAL_ISR(&timerMux);
  if (sts == true)
  {
    timerStart(timer_dac);
  }
  else
  {
    timerStop(timer_dac);
  }
  portEXIT_CRITICAL_ISR(&timerMux);
  dacEn = 0;
}

bool getTransmit()
{
  bool ret = false;
  if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
    ret = true;
  else
    ret = false;
  if (hw_afsk_dac_isr)
    ret = true;
  return ret;
}

void setTransmit(bool val)
{
  hw_afsk_dac_isr = val;
}

bool getReceive()
{
  bool ret = true;
  if ((digitalRead(_ptt_pin) ^ _ptt_active) == 0) // signal active with ptt_active
    return false;                                 // PTT Protection receive
  //if (digitalRead(LED_RX_PIN))                    // Check RX LED receiving.
  //  ret = true;
  return ret;
}

/**
 * @brief Controls PTT output
 * @param state False - PTT off, true - PTT on
 */
void setPtt(bool state)
{
  log_d("PTT Pin: %d, Active: %d, State: %d", _ptt_pin, _ptt_active, state);
  if (state)
  {
    setTransmit(true);
    #if defined(CONFIG_IDF_TARGET_ESP32S3)
    if((_ptt_pin > 25) && (_ptt_pin < 38))
      _ptt_pin = 5; // GPIO25-37 are flash only on ESP32S3
    #else
    if (_ptt_pin > 34)
      _ptt_pin = 32; // GPIO34 is the max pin for ESP32/ESP32S2
    #endif
    if (_ptt_active)
    {
      pinMode(_ptt_pin, OUTPUT);
      digitalWrite(_ptt_pin, HIGH);
    }
    else
    { // Open Collector to LOW
      pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
      digitalWrite(_ptt_pin, LOW);
    }
    LED_Status2(255, 0, 0);
  }
  else
  {
    setTransmit(false);
    // adcq.flush();
    if (_ptt_active)
    {
      pinMode(_ptt_pin, OUTPUT);
      digitalWrite(_ptt_pin, LOW);
    }
    else
    { // Open Collector to HIGH
      pinMode(_ptt_pin, OUTPUT_OPEN_DRAIN);
      digitalWrite(_ptt_pin, HIGH);
    }
    LED_Status2(0, 0, 0);
  }
}

uint8_t modem_config = 0;
void afskSetModem(uint8_t val, bool bpf, uint16_t timeSlot, uint16_t preamble, uint8_t fx25Mode)
{
  if (bpf)
    ModemConfig.flatAudioIn = 1;
  else
    ModemConfig.flatAudioIn = 0;

  if (val == 0)
  {
    ModemConfig.modem = MODEM_300;
#if defined(ADC_SAMPLE)
    SAMPLERATE = 9600;
    BLOCK_SIZE = (SAMPLERATE / 25);
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 9600;
    BLOCK_SIZE = (SAMPLERATE / 25);
#else
    SAMPLERATE = 19200;
    BLOCK_SIZE = (SAMPLERATE / 50);
#endif
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 1)
  {
    ModemConfig.modem = MODEM_1200;
#if defined(ADC_SAMPLE)
    SAMPLERATE = 9600;
    BLOCK_SIZE = (SAMPLERATE / 25);
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 19200;
    BLOCK_SIZE = (SAMPLERATE / 50);
#else
    SAMPLERATE = 28800;
    BLOCK_SIZE = (SAMPLERATE / 50);
#endif
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 2)
  {
    ModemConfig.modem = MODEM_1200_V23;
#if defined(ADC_SAMPLE)
    SAMPLERATE = 9600;
    BLOCK_SIZE = (SAMPLERATE / 25);    
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6)
    SAMPLERATE = 19200;
    BLOCK_SIZE = (SAMPLERATE / 50);
#else
    SAMPLERATE = 28800;
    BLOCK_SIZE = (SAMPLERATE / 50);
#endif
    BLOCK_SIZE = (SAMPLERATE / 50); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 9600);
  }
  else if (val == 3)
  {
    ModemConfig.modem = MODEM_9600;
    SAMPLERATE = 38400;
    BLOCK_SIZE = (SAMPLERATE / 100); // Must be multiple of resample ratio
    RESAMPLE_RATIO = (SAMPLERATE / 38400);
  }
  if (audio_buffer != NULL)
  {
    free(audio_buffer);
    audio_buffer = NULL;
  }
  audio_buffer = (float *)calloc(BLOCK_SIZE, sizeof(float));
  if (audio_buffer == NULL)
  {
    log_d("Error allocating memory for audio buffer");
    return;
  }
  log_d("Modem: %d, SampleRate: %d, BlockSize: %d", ModemConfig.modem, SAMPLERATE, BLOCK_SIZE);
  ModemConfig.usePWM = 1;
  ModemInit();
  Ax25Init(fx25Mode);
  if (fx25Mode > 0)
    Fx25Init();
  Ax25TimeSlot(timeSlot);
  Ax25TxDelay(preamble);
}

void afskSetHPF(bool val)
{
  // input_HPF = val;
}
void afskSetBPF(bool val)
{
  // input_BPF = val;
}
void afskSetSQL(int8_t val, bool act)
{
  _sql_pin = val;
  _sql_active = act;
}
void afskSetPTT(int8_t val, bool act)
{
  _ptt_pin = val;
  _ptt_active = act;
}
void afskSetPWR(int8_t val, bool act)
{
  _pwr_pin = val;
  _pwr_active = act;
}

// uint32_t ret_num;
// uint8_t *resultADC;

typedef struct
{
  voidFuncPtr fn;
  void *arg;
} interrupt_config_t;

// portMUX_TYPE DRAM_ATTR timerMux = portMUX_INITIALIZER_UNLOCKED;
//volatile SemaphoreHandle_t timerSemaphore;

#ifndef I2S_INTERNAL
int16_t adcPush;
// static TaskHandle_t s_task_handle;
//  adc_oneshot_unit_handle_t adc1_handle;
static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t stAdcHandle, const adc_continuous_evt_data_t *edata, void *user_data)
{
  // BaseType_t mustYield = pdFALSE;
  // Notify that ADC continuous driver has done enough number of conversions
  // vTaskNotifyGiveFromISR(s_task_handle, &mustYield);
  portENTER_CRITICAL_ISR(&timerMux);
  fifo.lock = true;
  for (uint32_t k = 0; k < edata->size; k += SOC_ADC_DIGI_RESULT_BYTES)
  {
    adc_digi_output_data_t *p = (adc_digi_output_data_t *)&edata->conv_frame_buffer[k];

#if defined(CONFIG_IDF_TARGET_ESP32)
    if (p->type1.channel > 0)
      continue;
    adcPush = (int16_t)p->type1.data;
#else
    if ((p->type2.channel > 0) || (p->type2.unit > 0))
      continue;
    adcPush = (int)p->type2.data;
#endif

    if (fifo.head >= BUFFER_SIZE || fifo.head < 0)
      RingBuffer_Init(&fifo); // Check if head exceeds buffer size
      //fifo.head = 0; // Check if head exceeds buffer size
    fifo.buffer[fifo.head] = adcPush;
    fifo.head = (fifo.head + 1) % BUFFER_SIZE; // Wrap around using modulo
    fifo.count++;
    // RingBuffer_Push(&fifo, adcPush);
  }
  fifo.lock = false;
  portEXIT_CRITICAL_ISR(&timerMux);
  // vTaskDelay(TMP102_UPDATE_CICLE_MS / portTICK_PERIOD_MS);
  // return (mustYield == pdTRUE);
  return true;
}
// static TaskHandle_t s_task_handle;
// static bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
// {
//     BaseType_t mustYield = pdFALSE;
//     //Notify that ADC continuous driver has done enough number of conversions
//     vTaskNotifyGiveFromISR(s_task_handle, &mustYield);

//     return (mustYield == pdTRUE);
// }

#ifndef ADC_SAMPLE

void adc_continue_init(void)
{
  adc_channel_t channel;
  adc_unit_t adc_unit = ADC_UNIT_1;
  esp_err_t Err = adc_continuous_io_to_channel(adc_pins[0], &adc_unit, &channel);
  if (Err != ESP_OK)
  {
    log_e("Pin %u is not ADC pin!", adc_pins[0]);
  }
  if (adc_unit != 0)
  {
    log_e("Only ADC1 pins are supported in continuous mode!");
  }

