nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
  uint32_t conv_frame_size = (uint32_t)(BLOCK_SIZE * SOC_ADC_DIGI_RESULT_BYTES);
  // uint32_t conv_frame_size = ADC_SAMPLES_COUNT;
  /* On initialise l'ADC : */
  adc_continuous_handle_cfg_t AdcHandleConfig = {
      .max_store_buf_size = (uint32_t)conv_frame_size * 2,
      .conv_frame_size = (uint32_t)conv_frame_size,
  };
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
  AdcHandleConfig.flags.flush_pool = true;
#endif
  Err = adc_continuous_new_handle(&AdcHandleConfig, &AdcHandle);
  if (Err != ESP_OK)
    log_d("AdMeasure : Adc Continuous Init Failed.");
  else
  {
    /* On configure l'ADC : */
    adc_continuous_config_t AdcConfig = {
#if defined(CONFIG_IDF_TARGET_ESP32)
        .sample_freq_hz = (uint32_t)(SAMPLERATE * 11 / 9),
#else
        .sample_freq_hz = (uint32_t)(SAMPLERATE),
#endif
        .conv_mode = ADC_CONV_SINGLE_UNIT_1, // On utilise uniquement l'ADC1.
        .format = ADC_OUTPUT_TYPE,           // On utilise le type 2. Pris dans l'exemple.
    };
    log_d("ADC Continuous Configuration Done. SAMPLERATE: %d Hz", AdcConfig.sample_freq_hz);

    adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
    AdcConfig.pattern_num = 1;
    // for (int ii = 0; ii < NBR_CHANNELS; ii++)
    //{
    // uint8_t unit = ADC_UNIT_1;
    // uint8_t ch = channel & 0x7;
    adc_pattern[0].atten = cfg_adc_atten;
    adc_pattern[0].channel = channel;
    adc_pattern[0].unit = ADC_UNIT_1;
    adc_pattern[0].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;
    //}
    AdcConfig.adc_pattern = adc_pattern;
    Err = adc_continuous_config(AdcHandle, &AdcConfig);
    if (Err != ESP_OK)
      ESP_LOGI(TAG, "=====> AdMeasure : Adc Continuous Configuration Failed.");
    else
    {
      // Setup callbacks for complete event
      adc_continuous_evt_cbs_t cbs = {
          .on_conv_done = s_conv_done_cb,
          //.on_pool_ovf can be used in future
      };
      // adc_handle[adc_unit].adc_interrupt_handle.fn = (voidFuncPtr)userFunc;
      Err = adc_continuous_register_event_callbacks(AdcHandle, &cbs, NULL);
      if (Err != ESP_OK)
      {
        log_e("adc_continuous_register_event_callbacks failed!");
      }

      // Attach the pins to the ADC unit
#ifdef ARDUINO_TEST
      for (int i = 0; i < cfg.channels; i++)
      {
        adc_channel = cfg.adc_channels[i];
        adc_continuous_channel_to_io(ADC_UNIT, adc_channel, &io_pin);
        // perimanSetPinBus: uint8_t pin, peripheral_bus_type_t type, void * bus, int8_t bus_num, int8_t bus_channel
        if (!perimanSetPinBus(io_pin, ESP32_BUS_TYPE_ADC_CONT, (void *)(ADC_UNIT + 1), ADC_UNIT, adc_channel))
        {
          LOGE("perimanSetPinBus to Continuous an ADC Unit %u failed!", ADC_UNIT);
          return false;
        }
      }
#endif // I2C
// adc_cali_line_fitting_config_t cali_config = {
//       .unit_id = ADC_UNIT_1,
//       .bitwidth = ADC_BITWIDTH_12,
//       .atten = ADC_ATTEN_DB_0,
//     };

// adc_continuous_start(AdcHandle);

// adc_cali_line_fitting_config_t cali_config = {
//     .unit_id = ADC_UNIT_1,
//     .atten = ADC_ATTEN_DB_0,
//     .bitwidth = ADC_BITWIDTH_12,
// };
// log_d("Creating ADC_UNIT_%d line cali handle", 1);
// Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
// // Err = adc_cali_create_scheme_curve_fitting(&Curve_Fitting, &AdcCaliHandle);
// if (Err != ESP_OK)
//   ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
// else
// {
//   /* On démarre l'ADC : */
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   adc_continuous_start(AdcHandle);
//   //adc_continuous_stop(AdcHandle);
//   //SYSCON.saradc_ctrl2.meas_num_limit = 0;
//   //HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
//   log_d("ADC Continuous has been start");
// }
/* Mise en place de la calibration permettant d'avoir les résultats en mV directement :
 * On utilise le schéma de calibration de type Courbe (Le seul proposé par la puce). */
#ifdef CONFIG_IDF_TARGET_ESP32
      adc_cali_line_fitting_config_t cali_config = {
#else
      adc_cali_curve_fitting_config_t cali_config = {
#endif
        .unit_id = ADC_UNIT_1,
        .atten = cfg_adc_atten,
        .bitwidth = ADC_BITWIDTH_12,
      };

#ifdef CONFIG_IDF_TARGET_ESP32
      Err = adc_cali_create_scheme_line_fitting(&cali_config, &AdcCaliHandle);
      log_d("Creating ADC_UNIT_%d line cali handle", 1);
//
#else
      Err = adc_cali_create_scheme_curve_fitting(&cali_config, &AdcCaliHandle);
      log_d("Creating ADC_UNIT_%d cerve cali handle", 1);
//
#endif

      // s_task_handle = xTaskGetCurrentTaskHandle();

      if (Err != ESP_OK)
        ESP_LOGI(TAG, "=====> AdMeasure : Fail to create the Curve Fitting Scheme.");
      else
      {
        // if(_sql_pin < 0){
        /* On démarre l'ADC : */
        // SYSCON.saradc_ctrl2.meas_num_limit = 0;
        adc_continuous_start(AdcHandle);
        // adc_continuous_stop(AdcHandle);
        // SYSCON.saradc_ctrl2.meas_num_limit = 0;
        // HAL_FORCE_MODIFY_U32_REG_FIELD(SYSCON.saradc_ctrl2, meas_num_limit, 0);
        log_d("ADC Continuous has been start");
        adcStopFlag = false;

        // }else{
        //   adc_continuous_stop(AdcHandle);
        //   adcStopFlag = true; // Stop ADC if SQL pin is set
        // }
      }
    }
  }
}
#endif
#endif // I2C

/*
 * Configure and initialize the sigma delta modulation
 * on channel 0 to output signal on GPIO4
 */
static void sigmadelta_init(void)
{
  sigmadelta_config_t sigmadelta_cfg = {
      .channel = SIGMADELTA_CHANNEL_0,
      .sigmadelta_duty = 127,
      .sigmadelta_prescale = 96,
#ifdef CONFIG_IDF_TARGET_ESP32C3
      .sigmadelta_gpio = GPIO_NUM_1, // GPIO1 is used for ESP32C3
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
      .sigmadelta_gpio = GPIO_NUM_2, // GPIO2 is used for ESP32S3
#else
      .sigmadelta_gpio = GPIO_NUM_26,
#endif
  };
  sigmadelta_config(&sigmadelta_cfg);
}

void AFSK_hw_init(void)
{
  // Set up ADC
  if (_sql_pin > -1)
    pinMode(_sql_pin, INPUT_PULLUP);
  if (_pwr_pin > -1)
    pinMode(_pwr_pin, OUTPUT);
  if (_led_tx_pin > -1)
  {
    pinMode(_led_tx_pin, OUTPUT);
  }
  if (_led_rx_pin > -1)
  {
    pinMode(_led_rx_pin, OUTPUT);
  }
  if (_led_strip_pin > -1)
  {
    if (strip == NULL)
      strip = new Adafruit_NeoPixel(1, _led_strip_pin, NEO_GRB + NEO_KHZ800);
  }

  if (_pwr_pin > -1)
    digitalWrite(_pwr_pin, !_pwr_active);

  RingBuffer_Init(&fifo); // Initialize the ring buffer

#ifdef I2S_INTERNAL
  //  Initialize the I2S peripheral
  I2S_Init(I2S_MODE_DAC_BUILT_IN, I2S_BITS_PER_SAMPLE_16BIT);
#else

