nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
#ifdef ADC_SAMPLE
  pinMode(15, OUTPUT);
  analogReadResolution(12);
  analogSetPinAttenuation(adc_pins[0], cfg_adc_atten);
  timer_adc = timerBegin(20000000);
  // Attach onTimer function to our timer.
  timerAttachInterrupt(timer_adc, &sample_adc_isr); // Attaches the handler function to the timer
  // Set alarm to call onTimer function every second (value in microseconds).
  // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
  timerAlarm(timer_adc, (uint64_t)20000000 / SAMPLERATE, true, 0);
  timerStart(timer_adc);

#else
  adc_continue_init();
#endif

// Initialize FIR filter
// resample_fir.coeffs = (float *)resample_coeffs;
// resample_fir.delay = filter_state;
// resample_fir.N = FILTER_TAPS;
// resample_fir.pos = 0;

// pinMode(MIC_PIN, INPUT);
//  Init ADC and Characteristics
//  esp_adc_cal_characteristics_t characteristics;
//  adc1_config_width(ADC_WIDTH_BIT_12);
//  adc1_config_channel_atten(SPK_PIN, cfg_adc_atten); // Input 1.24Vp-p,Use R 33K-(10K//10K) divider input power 1.2Vref
//  esp_adc_cal_characterize(ADC_UNIT_1, cfg_adc_atten, ADC_WIDTH_BIT_12, 0, &adc1_chars);

// adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_11); //Input 3.3Vp-p,Use R 10K divider input power 3.3V
// esp_adc_cal_get_characteristics(V_REF, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, &characteristics);
// log_d("v_ref routed to 3.3V\n");
#endif

  sigmadelta_init();
  log_d("Sigma Delta Initialized");
  // Create semaphore to inform us when the timer has fired
  //timerSemaphore = xSemaphoreCreateBinary();
  // Set timer frequency to 20Mhz
  timer_dac = timerBegin(20000000);
  // Attach onTimer function to our timer.
  timerAttachInterrupt(timer_dac, &sample_dac_isr); // Attaches the handler function to the timer
  // Set alarm to call onTimer function every second (value in microseconds).
  // Repeat the alarm (third parameter) with unlimited count = 0 (fourth parameter).
  timerAlarm(timer_dac, (uint64_t)20000000 / CONFIG_AFSK_DAC_SAMPLERATE, true, 0);
  timerStop(timer_dac);

  //   ESP_LOGI(TAG, "Create timer handle");
  //   gptimer_handle_t gptimer = NULL;
  //   gptimer_config_t timer_config = {
  //       .clk_src = GPTIMER_CLK_SRC_DEFAULT,
  //       .direction = GPTIMER_COUNT_UP,
  //       .resolution_hz = 8000000, // 1MHz, 1 tick=1us
  //   };
  //   ESP_ERROR_CHECK(gptimer_new_timer(&timer_config, &gptimer));

  //   gptimer_event_callbacks_t cbs = {
  //       .on_alarm = example_timer_on_alarm_cb,
  //   };
  //   ESP_ERROR_CHECK(gptimer_register_event_callbacks(gptimer, &cbs, queue));

  //   ESP_LOGI(TAG, "Enable timer");
  //   ESP_ERROR_CHECK(gptimer_enable(gptimer));

  //   ESP_LOGI(TAG, "Start timer, stop it at alarm event");
  //   gptimer_alarm_config_t alarm_config1 = {
  //       .alarm_count = (uint64_t)8000000/ SAMPLERATE, // period = 1s
  //   };
  //   alarm_config1.flags.auto_reload_on_alarm = true;
  //   alarm_config1.reload_count = 0;
  //   ESP_ERROR_CHECK(gptimer_set_alarm_action(gptimer, &alarm_config1));
  //   ESP_ERROR_CHECK(gptimer_start(gptimer));
  // if (xQueueReceive(queue, &ele, pdMS_TO_TICKS(2000))) {
  //     ESP_LOGI(TAG, "Timer stopped, count=%llu", ele.event_count);
  // } else {
  //     ESP_LOGW(TAG, "Missed one count event");
  // }

  setTransmit(false);
  log_d("AFSK Hardware Initialized");
}

void AFSK_init(int8_t adc_pin, int8_t dac_pin, int8_t ptt_pin, int8_t sql_pin, int8_t pwr_pin, int8_t led_tx_pin, int8_t led_rx_pin, int8_t led_strip_pin, bool ptt_act, bool sql_act, bool pwr_act)
{
  _adc_pin = adc_pin;
  _dac_pin = dac_pin;
  _ptt_pin = ptt_pin;
  _sql_pin = sql_pin;
  _pwr_pin = pwr_pin;
  _led_tx_pin = led_tx_pin;
  _led_rx_pin = led_rx_pin;
  _led_strip_pin = led_strip_pin;

  _ptt_active = ptt_act;
  _sql_active = sql_act;
  _pwr_active = pwr_act;

  if (xI2CSemaphore == NULL)
  {
    xI2CSemaphore = xSemaphoreCreateMutex();
    if ((xI2CSemaphore) != NULL)
      xSemaphoreGive((xI2CSemaphore));
  }

  tcb_t *tp = &tcb;
  int i = 0;
  tp->port = i;
  tp->kiss_type = i << 4;
  tp->avg = 2048;
  tp->cdt = false;
  tp->cdt_lvl = 0;
  tp->cdt_led_pin = 2;
  tp->cdt_led_on = 2;
  log_d("cdt_led_pin = %d, cdt_led_on = %d, port = %d", tp->cdt_led_pin, tp->cdt_led_on, tp->port);
// tp->ptt_pin = 12;
#ifdef FX25TNCR2
  tp->sta_led_pin = STA_LED_PIN[i];
#endif

#ifdef FX25_ENABLE
  tp->fx25_parity = FX25_PARITY[i]; // FX.25 parity
#endif
  tp->cdt_sem = xSemaphoreCreateBinary();
  assert(tp->cdt_sem);
  assert(xSemaphoreGive(tp->cdt_sem) == pdTRUE); // initialize

  // KISS default parameter
  // tp->fullDuplex = kiss_fullduplex[i]; // half duplex
  tp->fullDuplex = true;  // full duplex
  tp->SlotTime = 10;      // 100ms
  tp->TXDELAY = 50;       // 500ms
  tp->persistence_P = 63; // P = 0.25
  AFSK_hw_init();
}

int offset = 0;
int dc_offset = 620;
// void afskSetDCOffset(int val)
// {
//   dc_offset = offset = val;
// }

// bool dac_push(uint8_t data)
// {
//   if (dacq.isFull())
//   {
//     delay(5);
//   }
//   dacq.push(&data);
//   return true;
// }

bool sqlActive = false;

// #ifndef I2S_INTERNAL
//  int x=0;

uint8_t sinwave = 127;

bool adcq_lock = false;

uint16_t phaseAcc = 0;

void IRAM_ATTR sample_dac_isr()
{
  if (hw_afsk_dac_isr)
  {
    portENTER_CRITICAL_ISR(&timerMux); // ISR start
    sinwave = MODEM_BAUDRATE_TIMER_HANDLER();
    // Sigma-delta duty of one channel, the value ranges from -128 to 127, recommended range is -90 ~ 90.The waveform is more like a random one in this range.
    int8_t sine = (int8_t)(((sinwave - 127) * 12) >> 4); // Redue sine = -85 ~ 85
    sigmadelta_set_duty(SIGMADELTA_CHANNEL_0, sine);
    portEXIT_CRITICAL_ISR(&timerMux); // ISR end
    // Give a semaphore that we can check in the loop
    // xSemaphoreGiveFromISR(timerSemaphore, NULL);
  }
}

extern int mVrms;
extern float dBV;

long mVsum = 0;
int mVsumCount = 0;
uint8_t dcd_cnt = 0;
bool sqlActiveOld = false;
#define READ_LEN 256
// uint32_t ret_num = 0;
// uint8_t resultADC[READ_LEN] = {0};

void AFSK_Poll(bool SA818, bool RFPower)
{

  int mV;
  int x = 0;
  int16_t adc = 0;
  // uint8_t sintable[8] = {127, 217, 254, 217, 127, 36, 0, 36};
#ifdef I2S_INTERNAL
  size_t bytesRead;
  uint16_t pcm_in[ADC_SAMPLES_COUNT];
  uint16_t pcm_out[ADC_SAMPLES_COUNT];
#endif

  if (_sql_pin > -1)
  { // Set SQL pin active
    if ((digitalRead(_sql_pin) ^ _sql_active) == 0)
    { // signal active with sql_active
      sqlActive = true;
#if defined(ADC_SAMPLE)
      if (sqlActiveOld == false)
      {
        AFSK_TimerEnable(true); // Start ADC if SQL pin is set
      }
#endif
    }
    else
    {
      sqlActive = false;
      if (sqlActiveOld == true)
      {
        #if defined(ADC_SAMPLE)
        AFSK_TimerEnable(false); // Stop ADC if SQL pin is not set
        #endif
        LED_Status2(0, 0, 0);
      }
    }
  }
  else
  {
    sqlActive = true;
  }
  sqlActiveOld = sqlActive;

  if (hw_afsk_dac_isr)
  {

