nakhonthai/ESP32APRS_Audio/lib/LibAPRS_ESP32/AFSK.cpp
          if (x % m == 0)
          {
#ifdef ADC_SAMPLE
            mV = adc;
#else
            adc_cali_raw_to_voltage(AdcCaliHandle, adc, &mV);
#endif
            mV -= offset;
            // mVsum += powl(mV, 2); // VRMS = √(1/n)(V1^2 +V2^2 + … + Vn^2)
            // mV = (adcVal * Vref) >> 12;
            mVsum += mV * mV; // Accumulate squared voltage values
            mVsumCount++;
          }

          float sample = (float)adcVal / 2048.0f * agc_gain;
          audio_buffer[x] = sample;
        }
        // portEXIT_CRITICAL_ISR(&timerMux);
        //  Update AGC gain
        update_agc(audio_buffer, BLOCK_SIZE);
#ifdef ADC_SAMPLE
        offset = tp->avg;
#else
        adc_cali_raw_to_voltage(AdcCaliHandle, tp->avg, &offset);
#endif

        if (mVsumCount > 0)
        {
          tp->cdt_lvl = mVrms = sqrtl(mVsum / mVsumCount); // RMS voltage  VRMS = √(1/mVsumCount)(mVsum)
          mVsum = 0;
          mVsumCount = 0;
          if (mVrms > 10) // >-40dBm
          {
            if (dcd_cnt < 100)
              dcd_cnt++;
          }
          else if (mVrms < 5) // <-46dBm
          {
            if (dcd_cnt > 0)
              dcd_cnt--;
          }
          // Tool conversion dBv <--> Vrms at http://sengpielaudio.com/calculator-db-volt.htm
          // dBV = 20.0F * log10(Vrms);
          // log_d("Audio dc_offset=%d mVrms=%d", offset, mVrms);
        }

        if ((dcd_cnt > 3) || (ModemConfig.modem == MODEM_9600))
        {
          tp->cdt = true;
          //  Process audio block
          if (RESAMPLE_RATIO > 1)
            resample_audio(audio_buffer);

          // Process audio block
          int16_t sample;

          for (int i = 0; i < BLOCK_SIZE / RESAMPLE_RATIO; i++)
          {
            // Convert back to 12-bit audio (0-4095)
            sample = (int16_t)(audio_buffer[i] * 2048.0F);
            MODEM_DECODE(sample, mVrms);
          }
        }
        else
        {
          tp->cdt = false;
        }
        //digitalWrite(15, LOW);
      }
    }
    // #ifdef SQL
    //     }
    //     else
    //     {
    //       hdlc_flag_count = 0;
    //       hdlc_flage_end = false;
    //       LED_RX_OFF();
    //       sqlActive = false;
    //     }
    // #endif
  }
}
